In [2]:
import pandas as pd
import numpy as np

## 1. 데이터에서 IQR을 활용해 Fare컬럼의 이상치를 찾고, 이상치 데이터의 여성 수를 구하시오

In [3]:
df = pd.read_csv('./data/train.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
q1,q3 = df['Fare'].quantile([0.25,0.75])

iqr = q3 - q1

max_ = q3+1.5*iqr # q3,q1 +- 1.5*iqr (1.5잊지말기)
min_ = q1-1.5*iqr

x = df[(df['Fare']>max_)|(df['Fare']<min_)]

cnt = x['Sex'].value_counts()

print(cnt['female'])

70

## 2. basic1.csv에서 이상치(소수점 나이)를 찾고 올림, 내림, 버림(절사)했을때 3가지 모두 이상치 'age' 평균을 구한 다음 모두 더하여 출력하시오

- 올림 내림 버림 구하는 법 몰랐음

In [7]:
df2 = pd.read_csv('./data/basic1.csv')

In [6]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [165]:
int(1.4) - 1.4

-0.3999999999999999

In [28]:
# int(1.4)-1.4 != 0 일때 소수임을 이용
x = df2[(df2['age'].astype(dtype=int)-df2['age'])!=0]


x_ceil = np.ceil(x['age']).mean()  # 올림: np.ceil()
x_floor = np.floor(x['age']).mean()# 내림: np.floor()
x_trunc = np.trunc(x['age']).mean()# 버림: np.trunc()

print(x_ceil+x_floor+x_trunc)

69.5

## 3. 주어진 데이터에서 결측치가 80%이상 되는 컬럼은(변수는) 삭제하고, 80% 미만인 결측치가 있는 컬럼은 'city'별 중앙값으로 값을 대체하고 'f1'컬럼의 평균값을 출력하세요!

In [20]:
df3 = pd.read_csv('./data/basic1.csv')

In [21]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [22]:
f1_ = df3['f1'].isnull().sum()/len(df3)
f3_ = df3['f3'].isnull().sum()/df3.shape[0]

print(f1_,f3_)

0.31 0.95

In [23]:
df3.drop(['f3'],axis=1,inplace = True)

In [24]:
df3_g = df3.groupby(['city']).median()
df3_g

        age    f1   f2         f5
city
경기    63.00  58.0  0.0  69.730313
대구    57.50  75.0  0.0  33.308999
부산    47.00  62.0  1.0  52.667078
서울    31.65  68.0  1.0  67.886373

In [26]:
# fillna만 사용해서는 데이터가 바뀐값으로 저장되지 않음, 데이터에 넣어줘야함

df3[df3['city'] == '경기'] = df3[df3['city'] == '경기'].fillna(df3_g.loc['경기']['f1'])
df3[df3['city'] == '서울'] = df3[df3['city'] == '서울'].fillna(df3_g.loc['서울']['f1'])
df3[df3['city'] == '대구'] = df3[df3['city'] == '대구'].fillna(df3_g.loc['대구']['f1'])
df3[df3['city'] == '부산'] = df3[df3['city'] == '부산'].fillna(df3_g.loc['부산']['f1'])

print(df3['f1'].mean())

65.52

## 4. 주어진 데이터 중 train.csv에서 'SalePrice'컬럼의 왜도와 첨도를 구한 값과, 'SalePrice'컬럼을 스케일링(log1p)로 변환한 이후 왜도와 첨도를 구해 모두 더한 다음 소수점 2째자리까지 출력하시오

In [27]:
df4 = pd.read_csv('./data/data4.csv')

In [28]:
s1 = df4['SalePrice'].skew() # 왜도 구하기 : df.skew()
k1 = df4['SalePrice'].kurt() # 첨도 구하기 : df.kurt()

log = np.log1p(df4['SalePrice'])
s2 = log.skew()
k2 = log.kurt()

print(round(s1+s2+k1+k2 ,2)) # 2째자리까지 나타내기

9.35

## 5. 주어진 데이터 중 basic1.csv에서 'f4'컬럼 값이 'ENFJ'와 'INFP'인 'f1'의 표준편차 차이를 절대값으로 구하시오

In [30]:
df5 = pd.read_csv('./data/basic1.csv')

In [31]:
enfj = df5[df5['f4']=='ENFJ']['f1'].std()
infp = df5[df5['f4']=='INFP']['f1'].std()
           
print(abs(enfj-infp))

5.859621525876811

In [160]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

## 6. basic1.csv에서 'f1'컬럼 결측 데이터를 제거하고, 'city'와 'f2'을 기준으로 묶어 합계를 구하고, 'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값을 구하시오

In [32]:
df6 = pd.read_csv('./data/basic1.csv')

In [34]:
df6_d = df6.dropna(subset=['f1'])

df6_g = df6_d.groupby(['city','f2'],as_index = False).sum()

print(df6_g[(df6_g['city']=='경기')&(df6_g['f2']==0)]['f1'][0])

833.0

## 7. f4'컬럼의 값이 'ESFJ'인 데이터를 'ISFJ'로 대체하고, 'city'가 '경기'이면서 'f4'가 'ISFJ'인 데이터 중 'age'컬럼의 최대값을 출력하시오!

In [38]:
df7 = pd.read_csv('./data/basic1.csv')

In [39]:
df7['f4'] = df7['f4'].replace('ESFJ','ISFJ') # 값을 대체하려면 replace 사용 , 기존 값에 저장해줘야 유지됨

df7[(df7['city']=='경기')&(df7['f4']=='ISFJ')]['age'].max()

90.0

## 8. 주어진 데이터 셋에서 'f2' 컬럼이 1인 조건에 해당하는 데이터의 'f1'컬럼 누적합을 계산한다. 이때 발생하는 누적합 결측치는 바로 뒤의 값을 채우고, 누적합의 평균값을 출력한다. (단, 결측치 바로 뒤의 값이 없으면 다음에 나오는 값을 채워넣는다)

In [40]:
df8 = pd.read_csv('./data/basic1.csv')

In [27]:
x = df8[df8['f2']==1]['f1'].cumsum() # 누적합 구하기 : cumsum
x.fillna(method='bfill').mean() # 결측치의 바로 뒤의값으로 채우기 : fillna(method='bfill') / 바로 앞 : ffill

980.3783783783783

## 9. 주어진 데이터에서 'f5'컬럼을 표준화(Standardization (Z-score Normalization))하고 그 중앙값을 구하시오

In [42]:
df9 = pd.read_csv('./data/basic1.csv')

In [43]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

df9[['f5']] = scaler.fit_transform(df9[['f5']]) #2차원 df로 입력해야 2차원 array로 출력됨

print(df9['f5'].median())

0.260619629559015

In [44]:
x = scaler.fit_transform(df9[['f5']])

In [45]:
np.median(x)

0.26061962955901474

## 10. 주어진 데이터에서 20세 이상인 데이터를 추출하고 'f1'컬럼을 결측치를 최빈값으로 채운 후, f1 컬럼의 여-존슨과 박스콕스 변환 값을 구하고, 두 값의 차이를 절대값으로 구한다음 모두 더해 소수점 둘째 자리까지 출력(반올림)하시오

- 여 존슨 , 박스콕스는 구하지마

In [22]:
df10 = pd.read_csv('./data/basic1.csv')

In [23]:
df_20 = df10[df10['age']>=20]

df_20['f1'] = df_20['f1'].fillna(df_20['f1'].mode()[0]) # 최빈값은 출력시 값이 나오는게 아니고 인덱스랑 같이 나옴 [0] 해줘야함
                                                        # 다른 최대,최소, 중위값은 그대로 사용가능

## 11. 주어진 데이터에서 'f5'컬럼을 min-max 스케일 변환한 후, 상위 5%와 하위 5% 값의 합을 구하시오

In [47]:
df11 = pd.read_csv('./data/basic1.csv')

In [48]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
df11['f5'] = scaler.fit_transform(df11[['f5']])

x = df11['f5'].sort_values(ascending = False) # ascending = False(내림차순) : 큰수 -> 작은수

low,high = x.quantile([0.05,0.95])

print(low+high)

1.0248740983597389

In [50]:
df11['f5'].mode()

0    0.719705
1    0.833646
Name: f5, dtype: float64

## 12. 주어진 데이터에서 상위 10개 국가의 접종률 평균과 하위 10개 국가의 접종률 평균을 구하고, 그 차이를 구해보세요 (단, 100%가 넘는 접종률 제거, 소수 첫째자리까지 출력)

- ratio 가 접종률이고 이게 높은 국가 10개 뽑아서 접종률 상,하위 10개를 구하면 됨
- 접종률은 누적접종률과 같아

In [53]:
df12 = pd.read_csv('./data/data12.csv')

In [65]:
x = df12.groupby('country').max()['ratio'].sort_values(ascending=False)
top = x[x<100][:10].mean()
bottom = x[x<100][-10:].mean()

print(int(top-bottom))

88

## 13. 주어진 데이터에서 상관관계를 구하고, quality와의 상관관계가 가장 큰 값과, 가장 작은 값을 구한 다음 더하시오! 단, quality와 quality 상관관계 제외, 소수점 둘째 자리까지 출력

In [67]:
df13 = pd.read_csv('./data/wine.csv')

In [68]:
x = abs(df13.corr()['quality'].sort_values()[:-1]) # 가장 큰 상관관계를 갖는값은 자기 자신이므로 제외 / 상관관계에서 부호는 빼고 봐야함
print(round(x.max()+x.min(),2))

0.49

## 14.city와 f4를 기준으로 f5의 평균값을 구한 다음, f5를 기준으로 상위 7개 값을 모두 더해 출력하시오 (소수점 둘째자리까지 출력)

In [41]:
df14 = pd.read_csv('./data/basic1.csv')

In [44]:
x = df14.groupby(['city','f4']).mean()['f5'].sort_values(ascending=False)
print(round(x[:7].sum(),2))

643.68

## 15. 주어진 데이터 셋에서 age컬럼 상위 20개의 데이터를 구한 다음 f1의 결측치를 중앙값으로 채운다. 그리고 f4가 ISFJ와 f5가 20 이상인 f1의 평균값을 출력하시오!

In [70]:
df15 = pd.read_csv('./data/basic1.csv')

In [52]:
x = df15.sort_values(by='age',ascending=False)[:20] # 상위값 구할 때에는 ascending을 false로

x['f1'] = x['f1'].fillna(x['f1'].median())
x[(x['f4']=='ISFJ')&(x['f5']>=20)]['f1'].mean()

73.875

## 16. 주어진 데이터 셋에서 f2가 0값인 데이터를 age를 기준으로 오름차순 정렬하고 앞에서 부터 20개의 데이터를 추출한 후 f1 결측치(최소값)를 채우기 전과 후의 분산 차이를 계산하시오 (소수점 둘째 자리까지)

In [50]:
df16 = pd.read_csv('./data/basic1.csv')

In [51]:
x = df16[df16['f2']==0].sort_values(by='age')[:20]
f1_b = x['f1'].var()
f1_a = x['f1'].fillna(x['f1'].min()).var() # 분산 구하기 : var()

print(round(abs(f1_b-f1_a),2))

38.44

## 17. 2022년 5월 sales의 중앙값을 구하시오

### 방법 1 -> 년,월 형식의 파생변수 생성

In [73]:
df17 = pd.read_csv('./data/basic2.csv')

In [74]:
df17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    object
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 28.6+ KB

In [62]:
df17['year_month'] = [x[:7] for x in df17['Date'] ]

print(df17[df17['year_month'] == '2022-05']['Sales'].median())

1477685.0

### 방법 2 -> Date의 datatype를 datetime으로 변경 후 월과 일만 뽑아냄

In [63]:
df17 = pd.read_csv('./data/basic2.csv')

In [64]:
df17['Date'] = pd.to_datetime(df17['Date']) # pd.to_datetime을 사용해서 데이터타입 변환
                                            # 다른 값은 df.astype('type')을 사용해서 변환

df17['year'] = df17['Date'].dt.year         # .dt.year/month/day/dayofweek
df17['month'] = df17['Date'].dt.month
df17['day'] = df17['Date'].dt.day

x = df17[(df17['year']==2022) & (df17['month']==5)]
print(x['Sales'].median())

1477685.0

In [65]:
df17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
 5   year    730 non-null    int64
 6   month   730 non-null    int64
 7   day     730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(6)
memory usage: 45.8 KB

## 18. 주어진 데이터에서 2022년 5월 주말과 평일의 sales컬럼 평균값 차이를 구하시오 (소수점 둘째자리까지 출력, 반올림)

In [75]:
df18 = pd.read_csv('./data/basic2.csv')

In [76]:
df18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    object
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 28.6+ KB

In [86]:
df18['Date'] = pd.to_datetime(df18['Date'])

df18['year'] = df18['Date'].dt.year
df18['month'] = df18['Date'].dt.month
df18['dayofweek'] = df18['Date'].dt.dayofweek

holiday = []
for i in df18['dayofweek'] :
    if i == 5 or i == 6 :
        holiday.append(1)
    else :
        holiday.append(0)
        
df18['holiday'] = holiday 

mean_1 = df18[(df18['year']==2022)&(df18['month']==5)&(df18['holiday']==1)]['Sales'].mean()
mean_0 = df18[(df18['year']==2022)&(df18['month']==5)&(df18['holiday']==0)]['Sales'].mean()

print(round(abs(mean_1 - mean_0),2))

3010339.1

In [85]:
holiday = []
for i in df18['dayofweek'] :
    if i == 5 or i == 6 :
        holiday.append(1)
    else :
        holiday.append(0)
        
df18['holiday'] = holiday 

mean_1 = df18[(df18['year']==2022)&(df18['month']==5)&(df18['holiday']==1)]['Sales'].mean()
mean_0 = df18[(df18['year']==2022)&(df18['month']==5)&(df18['holiday']==0)]['Sales'].mean()

print(round(abs(mean_1 - mean_0),2))

3010339.1

In [87]:
a = df18[(df18['year']==2022)&(df18['month']==5)&((df18['dayofweek']==5)|(df18['dayofweek']==6))]['Sales'].mean()
b = df18[(df18['year']==2022)&(df18['month']==5)&(df18['dayofweek']!=5)&(df18['dayofweek']!=6)]['Sales'].mean()
a-b

3010339.1010101014

## 19. 주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과 2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오. 단 Events컬럼이 '1'인경우 80%의 Salse값만 반영함 (최종값은 소수점 반올림 후 정수 출력)

In [88]:
df19 = pd.read_csv('./data/basic2.csv')

In [89]:
df19['month'] = [x[5:7] for x in df19['Date']]
df19['year'] = [x[:4] for x in df19['Date']]

# df19[df19['Events']==1]['Sales'] = df19[df19['Events']==1]['Sales']*0.8 의 형식으로 일부만 변경하는건 오류가 난다

a =[]
for i,j in enumerate(df19['Events']): 
    if j == 1:
        a.append(df19.iloc[i]['Sales']*0.8) # for 문을 이용해서 리스트를 생성 후 변경해주기
    else :
        a.append(df19.iloc[i]['Sales'])

df19['Sales'] = a

df_22 = df19[df19['year']=='2022'] # 문자타입 데이터에서 뽑아와 파생변수를 만들면 그 파생변수의 타입도 문자
df_23 = df19[df19['year']=='2023']

max22 = df_22.groupby(['month']).sum()['Sales'].max()
max23 = df_23.groupby(['month']).sum()['Sales'].max()

print(round(abs(max23 - max22)))

42473436

## 20.basic1 데이터와 basic3 데이터를 'f4'값을 기준으로 병합하고, 병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼 합을 구하시오

In [98]:
df1 = pd.read_csv('./data/basic1.csv')
df2 = pd.read_csv('./data/basic3.csv')

In [101]:
# 조인하기 : pd.merge(df,df, how=('inner','outer'등 ) left_on = ,right_on= (인덱스 쓸때 left(right)_index=True))
df_join = pd.merge(df1,df2,how='left',on='f4') 

df_join.dropna(subset='r2', inplace =True)

print(df_join['f2'][:20].sum())

15

## 21. basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오

- 이상치는 음수, 0, 소수

In [102]:
df = pd.read_csv('./data/basic1.csv')

In [103]:
df_drop = df[(df['age']>0)&(((df['age'].astype('int'))-df['age'])==0)].copy()

# pd.cut(data, bins, label) : data를 범위기준 bin의 개수(범위)로 나눠주기(label은 각 구간의 이름)
#       - bins 지정 가능 ex) [5,15,25] 으로 입력 ->(5~15),(15~25)의 구간으로 나눠짐
# pd.qcut(data, bins) : data를 양(개수) 기준 bin의 개수로 나눠주기

df_drop['cut'] = pd.qcut(df_drop['age'],3)

df_drop.groupby('cut').median()['age'].sum()

165.0

## 22. 주어진 데이터(basic2.csv)에서 주 단위 Sales의 합계를 구하고, 가장 큰 값을 가진 주와 작은 값을 가진 주의 차이를 구하시오(절대값)

resample 참고 : https://seong6496.tistory.com/85

In [104]:
df = pd.read_csv('./data/basic2.csv')

In [105]:
df['Date'] = pd.to_datetime(df['Date']) 
df = df.set_index('Date') # resample 은 datetime의 형태를 가진 값이 인덱스에 있을 때 사용가능

df_w = df.resample('W').sum()
print(abs(df_w['Sales'].max()-df_w['Sales'].min()))

91639050

In [148]:
df.resample('W').sum()

               Sales       PV       UV  Events
Date
2022-01-02  22748304   401318   6710.0       1
2022-01-09  33373822  1148464  15189.0       2
2022-01-16  20754519   283773   9344.0       0
2022-01-23  21880751   538633   9841.0       1
2022-01-30  28878452   560814   7808.0       1
...              ...      ...      ...     ...
2023-12-03  47120909   884734  12086.0       2
2023-12-10  46398053   975024  21872.0       3
2023-12-17  20763518   291261  17221.0       0
2023-12-24  34528035   901451  11732.0       2
2023-12-31  51435189   813019  12168.0       2

[105 rows x 4 columns]

## 23. f1의 결측치를 채운 후 age 컬럼의 중복 제거 전과 후의 'f1' 중앙값 차이를 구하시오 (결측치는 f1의 데이터 중 내림차순 정렬 후 10번째 값으로 채움, 중복 데이터 발생시 뒤에 나오는 데이터를 삭제함 최종 결과값은 절대값으로 출력)

- 풀이에서는 x값을 구할 때 중복을 제거하고 구함

In [116]:
df = pd.read_csv('./data/basic1.csv')

In [114]:
x = df['f1'].sort_values(ascending=False).iloc[9] # 순서
df['f1'] = df['f1'].fillna(x)
be = df['f1'].median()

#중복제거 : drop_duplicates(['기준'], keep=남길값(first,last,False(다삭제))
df.drop_duplicates(['age'], keep='first', inplace=True)
af = df['f1'].median()


print(abs(be-af))

0.5

In [117]:
a = df.sort_values(by='f1',ascending=False).reset_index() # sort_value한 값을 불러서 쓰려면 
x = a['f1'][9]
df['f1'] = df['f1'].fillna(x)
be = df['f1'].median()

#중복제거 : drop_duplicates(['기준'], keep=남길값(first,last,False(다삭제))
df.drop_duplicates(['age'], keep='first', inplace=True)
af = df['f1'].median()


print(abs(be-af))

0.5

In [192]:
a = df.sort_values(by='f1',ascending=True)
a.iloc[9] # iloc는 9번째 행을 출력 (따라서 sort하고 나서 9번째 값을 뽑으려면 iloc)

a.loc[9] #loc는 인덱스 이름이 9인것을 출력, []는 loc가 기본값이기 때문에 loc로 출력하려면 reset해줘야함

id           id10
age          95.0
city           서울
f1           74.0
f2              1
f3            NaN
f4           ISFP
f5      98.429899
Name: 9, dtype: object

## 24. 주어진 데이터(basic2.csv)에서 "pv"컬럼으로 1일 시차(lag)가 있는 새로운 컬럼을 만들고(예: 1월 2일에는 1월 1일 pv데이터를 넣고, 1월 3일에는 1월 2일 pv데이터를 넣음),새로운 컬럼의 1월 1일은 다음날(1월 2일)데이터로 결측치를 채운 다음, Events가 1이면서 Sales가 1000000이하인 조건에 맞는 새로운 컬럼 합을 구하시오

In [108]:
df = pd.read_csv('./data/basic2.csv')

In [105]:
a=[np.nan]
for i in range(0,729):
    a.append(df['PV'][i])
    
df['pv2'] = a

df['pv2'].fillna(method='bfill',inplace=True)

df[(df['Events']==1)&(df['Sales']<=1000000)]['pv2'].sum()

1894876.0

In [111]:
# 풀이 방법
df['pv2'] = df['PV'].shift(1) #컬럼의 값을 변형시킴 (1) : 한칸씩 내리기, (-1): 한칸씩 올리기 (괄호안의 숫자 칸만큼 이동)

df['pv2'].fillna(method='bfill',inplace=True)
df[(df['Events']==1)&(df['Sales']<=1000000)]['pv2'].sum()

1894876.0

## 25. basic1 데이터에서 f4가 E로 시작하면서 부산에 살고 20대인 사람은 몇 명일까요?

In [119]:
df = pd.read_csv('./data/basic1.csv')

In [121]:
df['e'] = [x[0] for x in df['f4']]

x = df[(df['e']=='E')&(df['city']=='부산')&((df['age']>=20)&(df['age']<30))]

print(len(x))

0

## 26. basic1 데이터에서 f2 값에 시그모이드 함수(그림 내 수식)를 적용하고, f4가 ISFJ인 (변경된)f2의 합을 구하시오! (소수점 둘째자리까지 출력, 반올림)

In [129]:
df = pd.read_csv('./data/basic1.csv')

In [130]:
# 시그모이드 정의 
def sigmoid(x): 
    return 1 / (1 + np.exp(-x))

In [131]:
df['f2'] = df['f2'].apply(sigmoid) # 컬럼전체에 함수 적용할 때 에는 apply함수 사용

x = df[df['f4']=='ISFJ']['f2'].sum()

print(round(x,2))

7.15

## 27. basic1 데이터에서 age 값에 ReLU 함수를 적용하고, city가 부산인 (변경된)age의 평균을 구하시오! (소수점 둘째자리까지 출력, 절사)
- 절사 : 잘라서 버림

In [132]:
df = pd.read_csv('./data/basic1.csv')

In [133]:
def ReLU(x):
    if x < 0 :
        return 0
    else :
        return x

In [144]:
df['age'] = df['age'].apply(ReLU)

x = df[df['city']=='부산']['age'].mean()

# 소수점 몇째자리 까지만 나타내기 : '{:.2f}'.format(x) (2자리에 원하는 자리수를 입력하면 된다)
print('{:.2f}'.format(x))

49.89